cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/x11'
tap 'neovim/neovim'

brew 'ansible'
brew 'boot2docker'
brew 'brew-cask'
brew 'docker'

brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-librsvg', 'with-imagemagick']
    brew 'autoconf'
    brew 'pkg-config'

brew 'fish'
    brew 'pcre2'

brew 'go'

brew 'heroku-toolbelt'
brew 'imagemagick'
brew 'mosh'
brew 'neovim', args: ['HEAD']
    brew 'gettext'

brew 'nmap'
brew 'node'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'sbcl'
brew 'sqlite'
brew 'swi-prolog'
brew 'the_silver_searcher'
brew 'tmux'
    brew 'libevent'

brew 'tree'
brew 'watch'
brew 'youtube-dl'

cask 'ableton-live-suite'
cask 'appcleaner'
cask 'flux'
cask 'google-chrome'
cask 'grandperspective'
cask 'keycastr'
cask 'mumble'
cask 'racket'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'
