cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/devel-only'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'koekeishiya/formulae'
tap 'neovim/neovim'

brew 'aria2'
brew 'autoconf'  # the_silver_searcher
brew 'bc'  # linux
brew 'clang-format'
brew 'cloc'
brew 'cmus'
brew 'cocoapods'
brew 'docker'
brew 'elixir'
brew 'elm-format', args: ['devel']
brew 'emacs', args: ['HEAD', 'with-cocoa']
brew 'erlang'
brew 'fish'
brew 'fontconfig'  # graphviz
brew 'freetype'  # graphviz
brew 'gd'  # graphviz
brew 'gdbm'  # python3
brew 'gettext'  # neovim
brew 'glide'
brew 'gmp'  # swi-prolog
brew 'go'
brew 'graphviz'
brew 'heroku'
brew 'hub'
brew 'icu4c'  # node
brew 'jpeg'  # graphviz
brew 'khd'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kwm'
brew 'libevent'  # tmux
brew 'libpng'  # graphviz
brew 'libtermkey'  # neovim
brew 'libtiff'  # graphviz
brew 'libtool'  # graphviz
brew 'libuv'  # neovim
brew 'libvterm'  # neovim
brew 'lynis'
brew 'mosh'
brew 'mplayer'
brew 'msgpack'  # neovim
brew 'neovim', args: ['HEAD']
brew 'nmap'
brew 'node'
brew 'openssl'  # python
brew 'pcre'  # the_silver_searcher
brew 'pcre2' # fish
brew 'pkgconfig'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'readline'  # postgresql
brew 'reattach-to-user-namespace'  # macos
brew 'redis'
brew 'sqlite'
brew 'swi-prolog', args: ['HEAD']
brew 'swiftformat'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'tree'
brew 'unibilium'  # neovim
brew 'utf8proc'  # tmux
brew 'watch'  # macos
brew 'webp'  # graphviz
brew 'wxmac' # erlang
brew 'xz'  # linux # the_silver_searcher

cask 'appcleaner'
cask 'dash'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'grandperspective'
cask 'kindle'
cask 'minikube'
cask 'nvalt'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'thunderbird'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
