cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/devel-only'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'neovim/neovim'

brew 'clang-format'
brew 'elm-format', args: ['devel']
brew 'emacs', args: ['HEAD', 'with-cocoa']
brew 'fish'
    brew 'pcre2'
brew 'gpg'
    brew 'libgpg-error'
    brew 'libksba'
    brew 'libassuan'
    brew 'pinentry'
    brew 'pth'
    brew 'gpg-agent'
    brew 'dirmngr'
    brew 'libusb'
    brew 'libusb-compat'
    brew 'libgcrypt'
brew 'heroku'
brew 'neovim', args: ['HEAD']
    brew 'gettext'
    brew 'libtermkey'
    brew 'libuv'
    brew 'libvterm'
    brew 'msgpack'
    brew 'unibilium'
brew 'nmap'
brew 'node'
brew 'postgresql'
    brew 'readline'
brew 'python'
    brew 'openssl'
brew 'python3'
    brew 'gdbm'
brew 'reattach-to-user-namespace'
brew 'sqlite'
brew 'redis'
brew 'swi-prolog', args: ['HEAD']
    brew 'gmp'
brew 'the_silver_searcher'
    brew 'autoconf'
    brew 'pcre'
    brew 'xz'
brew 'tmux'
    brew 'utf8proc'
    brew 'libevent'
brew 'tree'
brew 'watch'
brew 'youtube-dl'
    brew 'ffmpeg'
    brew 'lame'
    brew 'xvid'

cask 'ableton-live-suite'
cask 'anki'
cask 'appcleaner'
cask 'dash'
cask 'google-chrome'
cask 'grandperspective'
cask 'kindle'
cask 'nvalt'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
