cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/devel-only'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'neovim/neovim'

brew 'bc'  # linux
brew 'clang-format'
brew 'cloc'
brew 'cocoapods'
brew 'docker'
brew 'docker-machine-driver-xhyve'
brew 'elm-format'
brew 'elixir'
    brew 'erlang'
brew 'elm-format', args: ['devel']
brew 'emacs', args: ['HEAD', 'with-cocoa']
brew 'fish'
    brew 'pcre2'
brew 'glide'
brew 'go'
brew 'gpg'
    brew 'libgpg-error'
    brew 'libksba'
    brew 'libassuan'
    brew 'pinentry'
    brew 'pth'
    brew 'gpg-agent'
    brew 'dirmngr'
    brew 'libusb'
    brew 'libusb-compat'
    brew 'libgcrypt'
brew 'graphviz'
brew 'heroku'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lynis'
brew 'mplayer'
brew 'mosh'
brew 'neovim', args: ['HEAD']
    brew 'gettext'
    brew 'libtermkey'
    brew 'libuv'
    brew 'libvterm'
    brew 'msgpack'
    brew 'unibilium'
brew 'nmap'
brew 'node'
    brew 'icu4c'
brew 'pkgconfig'
brew 'postgresql'
    brew 'readline'
brew 'python'
    brew 'openssl'
brew 'python3'
    brew 'gdbm'
brew 'reattach-to-user-namespace'  # macos
brew 'sqlite'
brew 'redis'
brew 'swi-prolog', args: ['HEAD']
    brew 'gmp'
brew 'swiftformat'
brew 'the_silver_searcher'
    brew 'autoconf'
    brew 'pcre'
    brew 'xz'  # linux
brew 'tmux'
    brew 'utf8proc'
    brew 'libevent'
brew 'tree'
brew 'watch'  # macos

cask 'amethyst'
cask 'appcleaner'
cask 'dash'
cask 'google-chrome'
cask 'google-drive'
cask 'grandperspective'
cask 'kindle'
cask 'minikube'
cask 'nvalt'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'vagrant'
cask 'virtualbox'
