cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/devel-only'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'neovim/neovim'

brew 'clang-format'
brew 'docker'
brew 'elm-format', args: ['devel']
brew 'fish'
    brew 'pcre2'
brew 'gpg'
    brew 'libgpg-error'
    brew 'libksba'
    brew 'libassuan'
    brew 'pinentry'
    brew 'pth'
    brew 'gpg-agent'
    brew 'dirmngr'
    brew 'libusb'
    brew 'libusb-compat'
    brew 'libgcrypt'
brew 'heroku'
brew 'leiningen'
brew 'neovim', args: ['HEAD']
    brew 'gettext'
brew 'nmap'
brew 'node'
brew 'postgresql'
    brew 'readline'
brew 'python'
    brew 'openssl'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'sqlite'
brew 'the_silver_searcher'
    brew 'pcre'
    brew 'xz'
brew 'tmux'
    brew 'utf8proc'
    brew 'libevent'
brew 'tree'
brew 'watch'
brew 'youtube-dl'

cask 'ableton-live-suite'
cask 'anki'
cask 'appcleaner'
cask 'docker'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'grandperspective'
cask 'java'
cask 'kindle'
cask 'racket'
cask 'skype'
cask 'vagrant'
cask 'virtualbox'
