cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/devel-only'
tap 'homebrew/services'
tap 'homebrew/x11'
tap 'koekeishiya/formulae'
tap 'neovim/neovim'

brew 'aria2'
brew 'autoconf'  # the_silver_searcher
brew 'bc'  # linux
brew 'boost'  # postgis
brew 'cgal'  # postgis
brew 'clang-format'
brew 'cloc'
brew 'cmus'
brew 'cocoapods'
brew 'docker'
brew 'elm-format', args: ['devel']
brew 'fish'
brew 'fontconfig'  # graphviz
brew 'freetype'  # graphviz
brew 'freexl'  # postgis
brew 'gd'  # graphviz
brew 'gdal'  # postgis
brew 'gdbm'  # python3
brew 'geos'  # postgis
brew 'gettext'  # neovim
brew 'giflib'  # postgis
brew 'glide'
brew 'gmp'  # swi-prolog
brew 'go'
brew 'graphviz'
brew 'heroku'
brew 'hub'
brew 'icu4c'  # node
brew 'jpeg'  # graphviz
brew 'json-c'  # postgis
brew 'libevent'  # tmux
brew 'libgeotiff'  # postgis
brew 'liblwgeom'  # postgis
brew 'libpng'  # graphviz
brew 'libspatialite'  # postgis
brew 'libtermkey'  # neovim
brew 'libtiff'  # graphviz
brew 'libtool'  # graphviz
brew 'libuv'  # neovim
brew 'libvterm'  # neovim
brew 'libxml2'  # postgis
brew 'lynis'
brew 'lzlib'  # postgis
brew 'mobile-shell'
brew 'mpfr'  # postgis
brew 'mplayer'
brew 'msgpack'  # neovim
brew 'neovim', args: ['HEAD']
brew 'nmap'
brew 'node'
brew 'openssl'  # python
brew 'pandoc'
brew 'pcre'  # the_silver_searcher
brew 'pcre2' # fish
brew 'pkgconfig'
brew 'postgis'
brew 'postgresql'
brew 'proj'  # postgis
brew 'protobuf'  # mobile-shell
brew 'python'
brew 'python3'
brew 'readline'  # postgresql
brew 'reattach-to-user-namespace'  # macos
brew 'redis'
brew 'sfcgal'  # postgis
brew 'sqlite'
brew 'swi-prolog', args: ['HEAD']
brew 'swiftformat'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'tree'
brew 'unibilium'  # neovim
brew 'utf8proc'  # tmux
brew 'watch'  # macos
brew 'webp'  # graphviz
brew 'xz'  # linux # the_silver_searcher

cask 'appcleaner'
cask 'dash'
cask 'firefox'
cask 'grandperspective'
cask 'kindle'
cask 'skim'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'teensy'
cask 'thunderbird'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'yubikey-piv-manager'
cask 'yubikey-personalization-gui'
cask 'yubico-authenticator'
