# tap repositories and their packages

tap 'caskroom/cask'
brew 'brew-cask'
cask 'appcleaner'
cask 'grandperspective'
cask 'google-chrome'
cask 'osxfuse'
cask 'skype'
cask 'virtualbox'

tap 'neovim/neovim'
brew 'neovim'

# Other Homebrew packages
brew 'ansible'
brew 'aspell'
brew 'fish'
brew 'gettext'
brew 'heroku-toolbelt'
brew 'imagemagick'
brew 'neovim'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'tmux'
brew 'tree'
brew 'youtube-dl'
